const textElement = document.getElementById('text');
const text = `Я пишу тебе это письмо, потому что мне нужно извиниться. Я понимаю, что мои неосознанные действия причинили тебе боль, и мне искренне жаль. Я никогда не хотел этого.

Я хочу, чтобы ты знала, как сильно я тебя люблю и обожаю. Ты – удивительная девушка, и я ценю твою искренность больше всего на свете.

Я помню наши прогулки по парку, как мы смеялись над забавными надписями на табличках. Эти моменты навсегда останутся в моём сердце. Я скучаю по нашим разговорам, по твоей улыбке, по всему, что связано с тобой.

Сейчас я чувствую вину, боль и тоску. Я не могу представить свою жизнь без тебя. Я хочу всё исправить и поговорить с тобой. Давай найдём время, чтобы обсудить всё спокойно, как мы это делали раньше, гуляя по парку.

Я верю, что мы сможем преодолеть эту трудность. Я очень надеюсь, что ты дашь мне шанс.`;

let charIndex = 0;

function typeText() {
    if (charIndex < text.length) {
        textElement.innerHTML += text.charAt(charIndex);
        charIndex++;
        setTimeout(typeText, 50); // Скорость печати (50 мс на символ)
    }
}

typeText();
